{
  "restaurant_name": [
   {
    "name": "Black Dog Smoke & Ale House",
    "url": "https://wanderlog.com/place/details/1450414/black-dog-smoke--ale-house",
    "rating": "4.6",
    "summary": "Black Dog Smoke & Ale House is a popular BBQ spot located near the University of Illinois campus in downtown Urbana, IL. Housed in a restored train depot, it offers delicious ribs, brisket, and burgers paired with craft beers. The restaurant also boasts a brick four-season porch for outdoor dining with open air from large windows and radiant heating units to keep guests warm on chilly nights.",
    "tags": "$$$$\naffordable\nBarbecue restaurantRestaurant",
    "contact": "320 N Chestnut St, Champaign, IL 61820, USA•http://www.blackdogchampaign.com/•(217) 954-0465•Tips and more reviews for Black Dog Smoke & Ale House"
   },
   {
    "name": "Sakanaya",
    "url": "https://wanderlog.com/place/details/2326863/sakanaya",
    "rating": "4.6",
    "summary": "Sakanaya, located on Green Street in Champaign, offers a stylish space where you can enjoy inventive sushi, ramen, Japanese entrees, and sake. The restaurant has gained popularity for its attention to detail in both the menu and decor. The owner's travels through Asia have influenced the restaurant's ambiance, while the chef's experience in New York City restaurants ensures high-quality cuisine.",
    "tags": "$$$$\naffordable\nSushi restaurantJapanese restaurant",
    "contact": "403 E Green St, Champaign, IL 61820, USA•http://www.sakanayarestaurant.com/•(217) 344-1400•Tips and more reviews for Sakanaya"
   },
   {
    "name": "Ko Fusion",
    "url": "https://wanderlog.com/place/details/2650332/ko-fusion",
    "rating": "4.3",
    "summary": "KoFusion is a trendy eatery that offers a diverse menu of contemporary American dishes and traditional sushi options. Situated in downtown Champaign, this stylish restaurant boasts a modern ambiance and a spacious outdoor patio adorned with chic decor. Patrons can relish in the stunning cityscape while savoring the delectable Chicago Roll, which comes highly recommended. The patio is equipped with numerous tall heaters strategically placed around the tables, ensuring that every customer can enjoy their meal comfortably.",
    "tags": "$$$$\nexpensive\nAsian fusion restaurantRestaurantSushi restaurant",
    "contact": "30 E Main St, Champaign, IL 61820, USA•http://www.kofusion.com/•(217) 531-1166•Tips and more reviews for Ko Fusion"
   },
   {
    "name": "Seven Saints",
    "url": "https://wanderlog.com/place/details/2384641/seven-saints",
    "rating": "4.6",
    "summary": "Seven Saints is a stylish American tavern with wood-trimmed interiors, offering creative burgers, craft beer, cocktails, and wine. The restaurant has the ambiance of an old British pub but with a unique American twist. It's known for its extensive selection of American beers, including seasonal choices. While sliders are their signature dish, they also offer a variety of other delicious items like pretzel bites, cheese curds, sandwiches, salads, soups and desserts from a local bakery.",
    "tags": "$$$$\naffordable\nBar & grillBar",
    "contact": "32 E Chester St, Champaign, IL 61820, USA•http://www.sevensaintsbar.com/•(217) 351-7775•Tips and more reviews for Seven Saints"
   },
   {
    "name": "Farren's Pub & Eatery",
    "url": "https://wanderlog.com/place/details/2649350/farrens-pub--eatery",
    "rating": "4.5",
    "summary": "Farren's Pub & Eatery is a laid-back establishment that offers a variety of American comfort food, including burgers and a selection of draft beers. Located in downtown Champaign, this popular spot opened its doors in 2019 and has quickly become a favorite among locals and visitors alike. Customers rave about the delicious burgers, with options like the spicy burger with ghost pepper cheese and one topped with mushrooms receiving high praise. The menu also features other tasty options such as chicken strips and cheese curds.",
    "tags": "$$$$\naffordable\nPubRestaurant",
    "contact": "117 N Walnut St, Champaign, IL 61820, USA•http://www.farrenspub.com/•(217) 359-6977•Tips and more reviews for Farren's Pub & Eatery"
   },
   {
    "name": "Papa Del's Pizza Factory",
    "url": "https://wanderlog.com/place/details/2939127/papa-dels-pizza-factory",
    "rating": "4.1",
    "summary": "Papa Del's Pizza Factory is a popular spot in Champaign known for its heaping deep-dish pizzas, pasta, and craft brews. The Sicilian pan pizza is their specialty and a must-try when visiting this stylish and spacious outpost. For those not into deep dish, they also offer thin crust and gluten-free options with vegan cheese. The restaurant has been a favorite among Illini since 1970 and is great for group gatherings due to its filling signature deep dish pizzas.",
    "tags": "$$$$\naffordable\nPizza restaurantBanquet hallDry ice supplierItalian restaurant",
    "contact": "1201 S Neil St, Champaign, IL 61820, USA•https://www.papadels.com/•(217) 359-7700•Tips and more reviews for Papa Del's Pizza Factory"
   },
   {
    "name": "Maize Mexican Grill",
    "url": "https://wanderlog.com/place/details/2274465/maize-mexican-grill",
    "rating": "4.5",
    "summary": "Maize Mexican Grill is a no-frills eatery in the vibrant campus town of University of Illinois Urbana-Champaign. Since its opening in 2011, it has been recreating authentic Mexican flavors from Michoacan and Guerrero. The restaurant prides itself on using fresh ingredients and making handmade corn tortillas. It's a popular spot for locals and visitors alike, with Guy Fieri even paying a visit.",
    "tags": "Permanently closed\n$$$$\ncheap\nMexican restaurantLatin American restaurant",
    "contact": "60 E Green St, Champaign, IL 61820, USA•http://www.maizemexicangrill.com/•(217) 355-6400•Tips and more reviews for Maize Mexican Grill"
   },
   {
    "name": "Big Grove Tavern",
    "url": "https://wanderlog.com/place/details/1576740/big-grove-tavern",
    "rating": "4.2",
    "summary": "Big Grove Tavern is a farm-to-table restaurant located in downtown Champaign, offering a modern space with rustic touches and a heated patio adorned with beautiful plants and flowers. The restaurant provides an ideal setting for various occasions, from weekday lunches to date nights or brunch gatherings. Guests can savor Chef Paradas' creative and evolving menu while enjoying a wide selection of craft cocktails and regional beers.",
    "tags": "$$$$\naffordable\nAmerican restaurantBar",
    "contact": "1 E Main St, Champaign, IL 61820, USA•http://www.biggrovetavern.com/•(217) 239-3505•Tips and more reviews for Big Grove Tavern"
   },
   {
    "name": "The Original Pancake House",
    "url": "https://wanderlog.com/place/details/2264883/the-original-pancake-house",
    "rating": "4.7",
    "summary": "The C-U Original Pancake House is a casual dining spot known for its signature pancakes and classic American breakfast dishes served all day. Located in Champaign, IL, it's a popular choice for locals and visitors alike. The menu features options like the meat lovers omelette, banana pancakes, and chocolate chip pancakes. While the omelette was generously filled and satisfying, the chocolate chip pancakes were described as slightly dry but easily remedied with syrup.",
    "tags": "$$$$\naffordable\nBreakfast restaurantAmerican restaurantPancake restaurantRestaurant",
    "contact": "1909 W Springfield Ave, Champaign, IL 61821, USA•http://ophchampaign.com/•(217) 352-8866•Tips and more reviews for The Original Pancake House"
   },
   {
    "name": "The Bread Company",
    "url": "https://wanderlog.com/place/details/1122119/the-bread-company",
    "rating": "4.6",
    "summary": "Located in the Urbana Arts District, The Bread Company is a family-owned establishment known for its European-style sandwiches served on freshly baked bread. In addition to sandwiches, the restaurant offers Swiss cuisine and pasta dishes. The lunch menu features a variety of hot and cold sandwiches, soups, and salads, while in the evening, guests can enjoy Swiss fondue accompanied by a selection of wines.",
    "tags": "$$$$\naffordable\nBistroRestaurant",
    "contact": "706 S Goodwin Ave, Urbana, IL 61801, USA•http://www.thebread.co/•(217) 383-1007•Tips and more reviews for The Bread Company"
   },
   {
    "name": "Pizzeria Antica",
    "url": "https://wanderlog.com/place/details/2845163/pizzeria-antica",
    "rating": "4.4",
    "summary": "Pizzeria Antica is a trendy establishment known for its wood-fired Neapolitan pizzas adorned with unique toppings and accompanied by a selection of wines. The overall quality of their pizza is commendable, boasting great flavor, quality cheese, and tasty sauce. However, some customers have noted that the tomato sauce could be slightly watery and the crust lacked a bit of crunch. Despite these minor drawbacks, the pizza remains enjoyable and should not be deemed bad in any way.",
    "tags": "$$$$\naffordable\nPizza restaurantNeapolitan restaurantRestaurant",
    "contact": "10 E Chester St, Champaign, IL 61820, USA•http://anticachampaign.com/•(217) 530-4137•Tips and more reviews for Pizzeria Antica"
   },
   {
    "name": "The Courier Cafe",
    "url": "https://wanderlog.com/place/details/2775311/the-courier-cafe",
    "rating": "4.5",
    "summary": "The Courier Cafe is a classic American eatery with a vintage atmosphere, offering a variety of burgers, sandwiches, and milkshakes. It's known for its delightful breakfast options and charming antique setting. The cafe serves breakfast, lunch, and dinner daily, making it a great choice for any mealtime. With an array of food options including salads, burgers, chicken dishes, and an extensive selection of milkshake flavors to choose from.",
    "tags": "$$$$\naffordable\nRestaurantAmerican restaurantBakery\nShow 6 more",
    "contact": "111 N Race St, Urbana, IL 61801, USA•http://couriercafeurbana.com/•(217) 328-1811•Tips and more reviews for The Courier Cafe"
   },
   {
    "name": "The Ribeye",
    "url": "https://wanderlog.com/place/details/2775310/the-ribeye",
    "rating": "4.5",
    "summary": "The Ribeye is a classic steakhouse in Champaign-Urbana known for its comfortable ambiance and delicious meat and fish dishes. One of their signature offerings is the steak dinner for two, featuring 16 ounces of hand-cut ribeye to share, along with unlimited trips to the salad bar, fresh baked bread, and a choice of side for each person. The restaurant has a welcoming and family-friendly atmosphere, making it suitable for both intimate dinners and gatherings with friends or loved ones.",
    "tags": "$$$$\nexpensive\nRestaurantAmerican restaurantBar & grill\nShow 4 more",
    "contact": "1701 S Neil St, Champaign, IL 61820, USA•https://www.theribeyerestaurant.org/•(217) 859-7201•Tips and more reviews for The Ribeye"
   },
   {
    "name": "Nando Milano",
    "url": "https://wanderlog.com/place/details/1122084/nando-milano",
    "rating": "4.2",
    "summary": "Nando Milano Trattoria is an Italian restaurant located at 204 N Neil St, Champaign, IL 61820. It offers a relaxed atmosphere with stylish brick walls and serves traditional Italian dishes along with a variety of wines. The menu includes options like arancini, gnocchi, rigatoni alla beppe, and branzino. Customers have praised the delicious food such as Arancini Di Risotto and Spaghetti Portofino.",
    "tags": "$$$$\nexpensive\nItalian restaurantRestaurant",
    "contact": "204 N Neil St, Champaign, IL 61820, USA•http://www.nandomilanochampaign.com/•(217) 954-1439•Tips and more reviews for Nando Milano"
   },
   {
    "name": "Sun Singer Restaurant, Wine & Spirits",
    "url": "https://wanderlog.com/place/details/2264654/sun-singer-restaurant-wine--spirits",
    "rating": "4.6",
    "summary": "Sun Singer Restaurant, Wine & Spirits has undergone a transformation from its cafe origins with an expanded dining room. The dinner menu offers a grown-up flair with options like steaks, fish, and four different kinds of paella. It's also a great spot for drinks and appetizers or al fresco dining in good weather. With an extensive collection of fine wines, beer, and spirits, Sun Singer is a must-visit for adults in Champaign.",
    "tags": "$$$$\naffordable\nRestaurantBeer storeGift basket store\nShow 4 more",
    "contact": "1115 W Windsor Rd, Champaign, IL 61821, USA•http://www.sunsingerwines.com/•(217) 351-1115•Tips and more reviews for Sun Singer Restaurant, Wine & Spirits"
   },
   {
    "name": "Watson's Shack & Rail",
    "url": "https://wanderlog.com/place/details/2845141/watsons-shack--rail",
    "rating": "4.5",
    "summary": "Watson's Shack & Rail is a new dining establishment in Champaign that specializes in Southern comfort food, particularly chicken. With an emphasis on fried chicken, this eatery also offers a variety of craft beer, cocktails, and slushies. Located in the downtown area, Watson's Shack & Rail is gaining attention for its unique cocktails and slushies. Customers have praised the friendly staff and enjoyable music selection. The gumbo is described as tasty but could have been hotter.",
    "tags": "$$$$\naffordable\nChicken restaurantAmerican restaurantBar\nShow 7 more",
    "contact": "211 N Neil St, Champaign, IL 61820, USA•http://www.watsonschicken.com/•(217) 607-0168•Tips and more reviews for Watson's Shack & Rail"
   },
   {
    "name": "Kohinoor Indian Restaurant and Lounge",
    "url": "https://wanderlog.com/place/details/2845175/kohinoor-indian-restaurant-and-lounge",
    "rating": "4.4",
    "summary": "Kohinoor Indian Restaurant and Lounge is a modest Indian eatery that offers a variety of tandoori fare and vegetarian dishes in an earth-toned setting. It has been praised as one of the best Indian restaurants in different states. The owner and staff are friendly and attentive, striking the perfect balance between engaging with customers without making them feel neglected. Even if you're not a fan of spicy food, there are plenty of mild options to choose from.",
    "tags": "$$$$\naffordable\nRestaurantBarEvent venue\nShow 3 more",
    "contact": "6 E Columbia Ave, Champaign, IL 61820, USA•http://www.kohinoorchampaign.com/•(217) 552-1384•Tips and more reviews for Kohinoor Indian Restaurant and Lounge"
   },
   {
    "name": "The Dancing Dog Eatery & Juicery",
    "url": "https://wanderlog.com/place/details/382278/the-dancing-dog-eatery--juicery",
    "rating": "4.6",
    "summary": "The Dancing Dog Eatery & Juicery is a casual and welcoming cafe that serves delicious vegan cuisine, such as hearty deep-dish pizza and refreshing juice options. This cozy establishment offers a variety of beverages including coffee, beer, and wine. The menu features an assortment of homey vegan dishes, including the Chef's patty made from a delightful blend of crunchy chickpeas and spices. Another tempting option is the pesto grilled cheese served with fries.",
    "tags": "Permanently closed\n$$$$\naffordable\nVegan restaurant",
    "contact": "126 W Main St, Urbana, IL 61801, USA•(217) 552-1344•Tips and more reviews for The Dancing Dog Eatery & Juicery"
   },
   {
    "name": "Everyday Kitchen - Champaign",
    "url": "https://wanderlog.com/place/details/2845197/everyday-kitchen-champaign",
    "rating": "4.4",
    "summary": "Everyday Kitchen in Champaign is a vibrant and modern restaurant that comes highly recommended for its delicious food and friendly staff. The menu offers a variety of options, from Kobe steak and eggs to Mushroom Vegan Tacos, all served with fresh and flavorful sides. The atmosphere is perfect for a date night or casual lunch, with colorful decor adding to the overall experience.",
    "tags": "Permanently closed\n$$$$\ncheap\nRestaurantBrunch restaurantCocktail bar",
    "contact": "1807 S Neil St, Champaign, IL 61820, USA•(217) 607-1960•Tips and more reviews for Everyday Kitchen - Champaign"
   },
   {
    "name": "Maize at the Station",
    "url": "https://wanderlog.com/place/details/3158479/maize-at-the-station",
    "rating": "4.4",
    "summary": "Maize at the Station is an upscale Mexican eatery located in a charmingly refurbished train station. Offering popular Mexican dishes and cocktails, patrons can enjoy the warm and convivial ambiance while indulging in unique options like nopal. The exceptional service is prompt and attentive, even accommodating special requests. The food is exquisite, expertly prepared with beautiful presentation. However, some customers may find a lack of traditional decorations and small plates that contribute to food spillage on the table.",
    "tags": "$$$$\ncheap\nMexican restaurant",
    "contact": "100 N Chestnut St, Champaign, IL 61820, USA•http://www.maizemexicangrill.com/•(217) 355-3611•Tips and more reviews for Maize at the Station"
   },
   {
    "name": "Cracked the Egg Came First",
    "url": "https://wanderlog.com/place/details/2886629/cracked-the-egg-came-first",
    "rating": "4.3",
    "summary": "Cracked the Egg Came First is a casual eatery located in a relaxed setting, offering counter-service breakfast options as well as grilled cheese and soups. It provides a convenient and quick dining experience, situated within a short walking distance from the Union. Their menu features a variety of delicious breakfast sandwiches, including the Vegasm sandwich which boasts a delightful combination of flavors and is satisfyingly filling.",
    "tags": "$$$$\naffordable\nBreakfast restaurant",
    "contact": "619 E Green St, Champaign, IL 61820, USA•http://www.crackedongreen.com/•(217) 954-0361•Tips and more reviews for Cracked the Egg Came First"
   },
   {
    "name": "Pandamonium Doughnuts",
    "url": "https://wanderlog.com/place/details/442037/pandamonium-doughnuts",
    "rating": "4.6",
    "summary": "Pandamonium Doughnuts is renowned for offering some of the finest doughnuts in town. Visitors are always impressed by their light and fluffy yeast doughnuts, as well as the moist and sweet cake options. The bakery prides itself on its wide range of flavors, including seasonal specials. To avoid disappointment, it is advisable to arrive early or pre-order online due to the high demand.",
    "tags": "BakeryCafeCoffee shopDonut shop",
    "contact": "1105 Windsor Rd, Champaign, IL 61821, USA•https://pandamoniumdoughnuts.wixsite.com/pandamoniumdoughnuts•Tips and more reviews for Pandamonium Doughnuts"
   },
   {
    "name": "DESTIHL Restaurant & Brew Works",
    "url": "https://wanderlog.com/place/details/10611695/destihl-restaurant--brew-works",
    "rating": "4.5",
    "summary": "DESTIHL Restaurant & Brew Works is a modern brewpub offering gourmet American cuisine alongside craft beer flights, organic wines, and spirits. It's a favorite spot for locals to bring visiting family and friends due to its fantastic food catering to various tastes and dietary needs. The beer-battered asparagus is a standout dish, and the desserts are consistently amazing. Guests praise the diverse selection of local beers from their microbrewery.",
    "tags": "Permanently closed\n$$$$\naffordable\nNew American restaurantBarBrewery\nShow 3 more",
    "contact": "301 N Neil St, Champaign, IL 61820, USA•http://www.destihl.com/•(217) 356-0301•Tips and more reviews for DESTIHL Restaurant & Brew Works"
   },
   {
    "name": "Jarling's Custard Cup",
    "url": "https://wanderlog.com/place/details/1122131/jarlings-custard-cup",
    "rating": "4.7",
    "summary": "Jarling's Custard Cup is a long-established frozen dessert store that serves in-house created treats in various forms such as cups, cones, sundaes, shakes and floats. Recently, they have made significant improvements to their drive-thru service and have streamlined their operations. The establishment is always clean and brightly lit, reminiscent of classic ice cream parlors from the past.",
    "tags": "$$$$\ncheap\nIce cream shopDessert shop",
    "contact": "309 W Kirby Ave, Champaign, IL 61820, USA•http://www.jarlingscustardcup.com/•(217) 352-2273•Tips and more reviews for Jarling's Custard Cup"
   },
   {
    "name": "Dos Reales Mexican Restaurant",
    "url": "https://wanderlog.com/place/details/2775313/dos-reales-mexican-restaurant",
    "rating": "4.5",
    "summary": "Dos Reales Mexican Restaurant is a lively and traditional eatery in Champaign that offers delicious Mexican cuisine and refreshing margaritas in a vibrant, rustic atmosphere. This authentic Hispanic establishment is known for its generous portions of flavorful dishes, particularly those featuring succulent steak or chicken covered in melted cheese. The menu also boasts unique cocktails and colorful margaritas to add excitement to your evening.",
    "tags": "$$$$\naffordable\nMexican restaurant",
    "contact": "1407 N Prospect Ave, Champaign, IL 61820, USA•(217) 351-6879•Tips and more reviews for Dos Reales Mexican Restaurant"
   },
   {
    "name": "Hamilton Walker's",
    "url": "https://wanderlog.com/place/details/2845161/hamilton-walkers",
    "rating": "4.4",
    "summary": "Hamilton Walker's is a classy American steakhouse located in an 1880s building in downtown Champaign. The restaurant offers a historical dining experience with a retro vibe and specialty cocktails. Known for its succulent steaks, fresh seafood choices, and refreshing cocktails, it provides an exquisite dining experience. Customers have praised the attentive service and perfectly cooked steaks while enjoying the relaxed yet sophisticated atmosphere. Amidst the pandemic, Hamilton Walker's has created a comfortable environment for its patrons to enjoy their meals.",
    "tags": "$$$$\nexpensive\nSteak house",
    "contact": "201 N Neil St, Champaign, IL 61820, USA•https://www.hamiltonwalkers.com/?y_source=1_NTM2NjMyNDEtNzE1LWxv…•(217) 350-0363•Tips and more reviews for Hamilton Walker's"
   },
   {
    "name": "Le Peep",
    "url": "https://wanderlog.com/place/details/2650603/le-peep",
    "rating": "4.5",
    "summary": "Le Peep is a laid-back eatery that serves a wide range of uncomplicated dishes and coffee beverages. Expect a wait for Sunday breakfast, with an outdoor patio available for those waiting. While not upscale, the restaurant provides a comfortable setting for morning meals. The Garden Eggs Benedict, featuring spinach and vegetables, is highly recommended. However, the Ronoco brand of coffee served is average at best. The dish comes with dry and bland diced potatoes as well as slightly lacking cooked apples on the side.",
    "tags": "$$$$\naffordable\nBreakfast restaurant",
    "contact": "2209 S Neil St, Champaign, IL 61820, USA•http://champaignlepeep.com/•(217) 352-7599•Tips and more reviews for Le Peep"
   },
   {
    "name": "Thara Thai Restaurant",
    "url": "https://wanderlog.com/place/details/1122090/thara-thai-restaurant",
    "rating": "4.6",
    "summary": "Thara Thai Restaurant is a popular spot that offers a mix of Thai and Chinese dishes in a simple yet cozy setting with comfortable booths and Asian decor. The menu features the signature Thara Thai pad Thai, which stands out for its generous portion size and authentic combination of thin noodles, bean sprouts, eggs, green onion, peanuts, lime, and choice of protein. Customers also praise the restaurant's skill in preparing noodles, curry dishes, and fried rice to perfection.",
    "tags": "$$$$\naffordable\nThai restaurantAsian restaurantPan-Asian restaurant\nShow 2 more",
    "contact": "912 1/2 W Bloomington Rd, Champaign, IL 61821, USA•http://tharathairestaurant.com/•(217) 378-1986•Tips and more reviews for Thara Thai Restaurant"
   },
   {
    "name": "Timpone's",
    "url": "https://wanderlog.com/place/details/2648473/timpones",
    "rating": "4.2",
    "summary": "Timpone's is a serene Italian restaurant tucked away near the popular Canopy Club, offering a diverse menu of local and organic dishes. The restaurant boasts an extensive wine list with over 400 unique bottles, making it a perfect spot for wine enthusiasts. With its authentic Italian cuisine including pizza and fresh pasta, Timpone's provides an opportunity to experience the flavors of Italy in Urbana.",
    "tags": "$$$$\nexpensive\nItalian restaurantPizza restaurant",
    "contact": "710 S Goodwin Ave, Urbana, IL 61801, USA•http://timpones-urbana.com/•(217) 344-7619•Tips and more reviews for Timpone's"
   },
   {
    "name": "Crane Alley",
    "url": "https://wanderlog.com/place/details/2775312/crane-alley",
    "rating": "4.5",
    "summary": "Crane Alley is an upscale-casual gastropub offering a diverse menu of Modern American dishes, including entrees, burgers, sandwiches, and craft beers. Visitors rave about the fantastic food and unique offerings such as pretzel bites, Turkey pita with Mac and cheese, chili with amazing flavor but a bit of unexpected spiciness. The place also boasts a great selection of beers for enthusiasts. Guests appreciate the ambiance with old-time jazz playing in the background.",
    "tags": "Permanently closed\n$$$$\naffordable\nGastropubAmerican restaurantBar\nShow 2 more",
    "contact": "115 W Main St, Urbana, IL 61801, USA•(217) 384-7526•Tips and more reviews for Crane Alley"
   },
   {
    "name": "Panera Bread",
    "url": "https://wanderlog.com/place/details/2886623/panera-bread",
    "rating": "4.0",
    "summary": "Panera Bread is a popular bakery and cafe chain known for its freshly baked bread, healthy soups, and handcrafted sandwiches made from fresh ingredients. It offers a variety of options for vegetarians as well. The atmosphere at Panera Bread is calm and relaxing with elegant seating. Customers can enjoy free WiFi while indulging in their meals. The chain also provides convenient services such as drive-through and online ordering with quick service.",
    "tags": "$$$$\naffordable\nCafeBakeryBreakfast restaurant\nShow 7 more",
    "contact": "1903 Convenience Pl, Champaign, IL 61820, USA•https://www.panerabread.com/en-us/cafe/locations/il/champaign/19…•(217) 239-5000•Tips and more reviews for Panera Bread"
   },
   {
    "name": "El Toro Bravo",
    "url": "https://wanderlog.com/place/details/2922815/el-toro-bravo",
    "rating": "4.2",
    "summary": "El Toro Bravo is a popular Mexican eatery offering an extensive menu of traditional dishes, along with a variety of margaritas, tequilas, and beers. The restaurant has received positive reviews for its prompt and attentive service, as well as the excellent taste of their food. Customers have particularly enjoyed the flavorful hot and spicy burritos and the delicious quesadillas and chicken strips that are perfect for kids. The restaurant also provides complimentary chips and salsa, which adds to the overall dining experience.",
    "tags": "$$$$\naffordable\nMexican restaurant",
    "contact": "2561 W Springfield Ave, Champaign, IL 61821, USA•http://www.eltororestaurante.com/•(217) 351-7024•Tips and more reviews for El Toro Bravo"
   },
   {
    "name": "Manzella's Italian Patio",
    "url": "https://wanderlog.com/place/details/2648646/manzellas-italian-patio",
    "rating": "4.5",
    "summary": "Manzella's Italian Patio is an unpretentious and long-lasting Italian establishment that offers a variety of pasta, sandwiches, and classic red-sauced dishes. For over twenty years, they have been known for serving some of the most authentic pizza in Central Illinois. Their Bianca pizza is particularly delicious. The service at Manzella's is excellent - attentive without being overly intrusive. The bartender is well-informed about their wine selection.",
    "tags": "$$$$\naffordable\nItalian restaurantPizza restaurant",
    "contact": "115 S 1st St, Champaign, IL 61820, USA•http://manzellasitalianrestaurant.com/•(217) 352-7624•Tips and more reviews for Manzella's Italian Patio"
   },
   {
    "name": "Cafe Kopi",
    "url": "https://wanderlog.com/place/details/2886643/caf-kopi",
    "rating": "4.5",
    "summary": "Cafe Kopi is a down-to-earth coffeehouse located in downtown Champaign, known for its welcoming atmosphere and delicious array of drinks and food items. With 22 years of experience, it has become a steadfast spot for patrons looking to unwind with a cup of the best Chai tea in town or indulge in tasty bakery treats. The spacious and cozy ambiance makes it an ideal spot for students to study or colleagues to meet.",
    "tags": "$$$$\ncheap\nCafe",
    "contact": "109 N Walnut St, Champaign, IL 61820, USA•http://cafe-kopi.com/•(217) 359-4266•Tips and more reviews for Cafe Kopi"
   },
   {
    "name": "The Himalayan Chimney",
    "url": "https://wanderlog.com/place/details/2845167/the-himalayan-chimney",
    "rating": "4.3",
    "summary": "The Himalayan Chimney is a contemporary restaurant located on vibrant Church St, offering familiar Indian dishes such as samosas, biryani, tandoori, and curry. The elegant interiors with Indian God/Goddess statues and fire lamps create an authentic feel. The restaurant serves authentic Indian flavors with the perfect combination of spices and fresh ingredients. Customers appreciate the delicious cuisine, excellent variety of choices, consistent quality of food, and good service. Some feedback includes a recommendation for cleaner bathrooms.",
    "tags": "$$$$\naffordable\nIndian restaurantAsian restaurant",
    "contact": "134 W Church St, Champaign, IL 61820, USA•(217) 552-1834•Tips and more reviews for The Himalayan Chimney"
   },
   {
    "name": "Monical's Pizza",
    "url": "https://wanderlog.com/place/details/382273/monicals-pizza",
    "rating": "4.4",
    "summary": "Monical's Pizza is a popular Italian eatery renowned for its thin-crust and deep-dish pizzas, as well as their delectable salad dressing for dipping. It caters to groups of various sizes, promptly greeting and seating them with prepared tables in under 10 minutes. The attentive staff efficiently takes orders and serves the food within a reasonable time frame. The restaurant operates like a well-oiled machine, with the manager overseeing all aspects, including assistance in the cooking area.",
    "tags": "$$$$\naffordable\nPizza restaurantItalian restaurantDelivery RestaurantRestaurant",
    "contact": "205 N Mattis Ave, Champaign, IL 61821, USA•https://www.monicals.com/locations/monicals-pizza-of-champaign-n…•(217) 359-3514•Tips and more reviews for Monical's Pizza"
   },
   {
    "name": "Manolo's Pizza & Empanadas",
    "url": "https://wanderlog.com/place/details/1449727/manolos-pizza--empanadas",
    "rating": "4.4",
    "summary": "Manolo's Pizza & Empanadas is a fast, innovative eatery that serves a variety of empanadas and pizzas, including options made with vegetarian meat alternatives. Their thin crust, New York style pizzas are expertly crafted and worth the slightly higher price tag. With an extensive selection of toppings to choose from, there is sure to be something for everyone's taste. Online ordering allows customers to customize their pizza by splitting each half with different toppings.",
    "tags": "$$$$\ncheap\nPizza restaurantFast food restaurantItalian restaurant",
    "contact": "1115 W Oregon St, Urbana, IL 61801, USA•http://manolospizza.com/•(217) 365-0110•Tips and more reviews for Manolo's Pizza & Empanadas"
   },
   {
    "name": "Mia Za's",
    "url": "https://wanderlog.com/place/details/2939178/mia-zas",
    "rating": "4.4",
    "summary": "Mia Za's is a relaxed, self-service eatery that serves delicious pizza and straightforward Italian dishes like panini, pasta, and salads. Their concept revolves around using top-notch ingredients to create food that is undeniably enjoyable. With four options to choose from - pizzas, sandwiches, pasta, and salads - customers have the freedom to select from an impressive variety of ingredients.",
    "tags": "$$$$\ncheap\nItalian restaurantCafePizza restaurant",
    "contact": "629 E Green St #5701, Champaign, IL 61820, USA•http://www.miazas.com/•(217) 298-3198•Tips and more reviews for Mia Za's"
   },
   {
    "name": "Broadway Food Hall",
    "url": "https://wanderlog.com/place/details/2845135/broadway-food-hall",
    "rating": "4.6",
    "summary": "Urbana is also the location of the trendy new Broadway Food Hall, a food court that offers an assortment of some of central Illinois' finest eateries. Visitors can explore the contemporary and industrial-style layout to discover dishes such as a poke bowl, artisanal grilled cheese, or a filling pastrami sandwich. One standout eatery at Broadway Food Hall is Muchacho, renowned for its fusion Korean/Mexican rice bowls.",
    "tags": "Restaurant",
    "contact": "401 N Broadway Ave, Urbana, IL 61801, USA•http://broadwayfoodhall.com/•(217) 374-4105•Tips and more reviews for Broadway Food Hall"
   },
   {
    "name": "San Maru Korean Restaurant",
    "url": "https://wanderlog.com/place/details/441721/san-maru-korean-restaurant",
    "rating": "4.6",
    "summary": "San Maru Korean Restaurant is a family-owned establishment that offers authentic Korean American cuisine, inspired by generations of passionate Korean cooks. The owners' mother and grandmother were invited to cook for the last King of the Chosun dynasty, and their culinary legacy lives on at San Maru. The warm welcome from the owner and staff creates a delightful dining experience, with friendly explanations of dishes and recommendations for unique desserts.",
    "tags": "$$$$\naffordable\nKorean restaurantRestaurant",
    "contact": "2504 Village Green Pl, Champaign, IL 61822, USA•https://sanmarucu.square.site/•(217) 352-2119•Tips and more reviews for San Maru Korean Restaurant"
   },
   {
    "name": "Naya Indian Cuisine",
    "url": "https://wanderlog.com/place/details/2206702/naya-indian-cuisine",
    "rating": "4.2",
    "summary": "If I'm choosing a dessert, it will definitely have chocolate in some form. Chocolate is my ultimate love. However, lately I've been drawn to tangy and tart flavors as well. The Carne Asada marinade for tacos at Naya Indian Cuisine is unlike anything you've ever tasted at other restaurants. Unlike the usual practice of pre-baking and storing bakery items for the day, this restaurant prepares everything fresh.",
    "tags": "$$$$\naffordable\nIndian restaurant",
    "contact": "212 E Green St Ste #104, Champaign, IL 61820, USA•https://nayaindiancuisineil.com/•(217) 607-1161•Tips and more reviews for Naya Indian Cuisine"
   },
   {
    "name": "Hopscotch Bakery + Market",
    "url": "https://wanderlog.com/place/details/2264987/hopscotch-bakery--market",
    "rating": "4.3",
    "summary": "Hopscotch Bakery + Market, located on John St. in Champaign, offers a wide selection of delicious treats for pre-order and pickup. Their menu includes classic pumpkin pie, mini pecan pies, apple cardamom cranberry pie, vegan and gluten-free pumpkin cake, holiday rolls, and turkey pot pie strata. Customers can choose from fresh original or fresh familiar pastries to enjoy with friends or take home for later indulgence.",
    "tags": "$$$$\naffordable\nBakery",
    "contact": "802 W John St, Champaign, IL 61820, USA•http://www.hopscotchmarket.com/•Tips and more reviews for Hopscotch Bakery + Market"
   },
   {
    "name": "Golden Wok",
    "url": "https://wanderlog.com/place/details/3006876/golden-wok",
    "rating": "4.3",
    "summary": "Golden Wok is an unpretentious eatery in Champaign that specializes in both Thai and Chinese cuisine. They serve a variety of favorites, ranging from the classic pad Thai to the popular sweet and sour chicken. The restaurant is known for its delicious and authentic dishes, which are of very high quality. Whether you choose to dine in or opt for takeout, Golden Wok ensures a satisfying experience with its upscale ambiance, making it a great choice for date nights.",
    "tags": "$$$$\ncheap\nThai restaurant",
    "contact": "405 E University Ave, Champaign, IL 61820, USA•http://www.champaigngoldenwok.com/?utm_source=gmb&utm_medium=web…•(217) 356-8383•Tips and more reviews for Golden Wok"
   },
   {
    "name": "Sushi Ichiban",
    "url": "https://wanderlog.com/place/details/2977202/sushi-ichiban",
    "rating": "4.0",
    "summary": "Sushi Ichiban is an uncomplicated fast-food establishment that serves sushi and traditional Japanese dishes such as noodle soups and teriyaki meals. The cuisine is delectable, and the prices are reasonable. One satisfied customer describes their Chicken Stir Fried Udon as outstanding, claiming it to be the best they've had in Urbana Champaign up until now. It's advisable not to request double noodles, as it can be overwhelming; the regular portion size is more than sufficient.",
    "tags": "$$$$\ncheap\nSushi restaurantAsian restaurantJapanese restaurant",
    "contact": "619 S Wright St, Champaign, IL 61820, USA•https://www.sushiichiban.net/•(217) 954-0493•Tips and more reviews for Sushi Ichiban"
   },
   {
    "name": "Baldarotta's Porketta & Sicilian Sausage",
    "url": "https://wanderlog.com/place/details/1122133/baldarottas-porketta--sicilian-sausage",
    "rating": "4.7",
    "summary": "If there's one suggestion I have for dining in Champaign-Urbana, it's to prioritize visiting Baldarotta's Porketta & Sicilian Sandwiches. Situated inside the Lincoln Square Mall, this Sicilian eatery may appear unassuming at first glance, but don't let that deter you. This place is highly regarded and beloved by many due to its delectable food and consistently friendly staff.",
    "tags": "$$$$\naffordable\nSandwich shop",
    "contact": "300 S Broadway Ave, Urbana, IL 61801, USA•http://www.baldarottas.com/•(217) 800-5726•Tips and more reviews for Baldarotta's Porketta & Sicilian Sausage"
   },
   {
    "name": "Suzu's Bakery",
    "url": "https://wanderlog.com/place/details/1122111/suzus-bakery",
    "rating": "4.7",
    "summary": "Suzu's Bakery offers excellent customer service, with helpful front staff who are willing to explain anything. A unique aspect of this bakery is the ability to see into the kitchen and watch the baking process. Despite this, their prices remain affordable, surprising customers who expected higher costs due to in-house baking. The hot tea selection is a must-try, particularly the Ginger Peach and Pineapple Lychee flavors which are truly fantastic.",
    "tags": "$$$$\ncheap\nDessert shopBakeryJapanese confectionery shopJapanese sweets restaurant",
    "contact": "114 N Walnut St, Champaign, IL 61820, USA•http://suzusbakery.com/•(217) 355-5400•Tips and more reviews for Suzu's Bakery"
   },
   {
    "name": "Mid Summer Lounge",
    "url": "https://wanderlog.com/place/details/441884/mid-summer-lounge",
    "rating": "4.4",
    "summary": "Mid Summer Lounge is a Chinese restaurant located in Champaign's campustown area, offering a relaxed dining atmosphere. They serve a wide range of Chinese dishes, from noodle soups to dumplings and wontons. The menu includes various flavors of ramen and dumplings, which are particularly popular among customers. Their Schachman-style beef noodles are highly recommended by patrons who appreciate the flavorful broth.",
    "tags": "$$$$\naffordable\nChinese noodle restaurantDumpling restaurantSmall plates restaurant",
    "contact": "623 E Green St, Champaign, IL 61820, USA•https://www.midsummerlounge.com/•(217) 607-1434•Tips and more reviews for Mid Summer Lounge"
   }
  ]
 }